In [1]:
import pandas as pd

In [14]:
df_student_math = pd.DataFrame({'student':['Tom','Jack','Dan','Ram','Jeff','David'], 'ID':[10,56,31,85,9,22]})

In [15]:
df_student_science = pd.DataFrame({'student':['Tom','Ram','David'], 'ID':[10,12,22]})

In [16]:
pd.merge(df_student_math,df_student_science)

   ID student
0  10     Tom
1  22   David

In [17]:
pd.merge(df_student_math,df_student_science,on='student')

   ID_x student  ID_y
0    10     Tom    10
1    85     Ram    12
2    22   David    22

In [18]:
pd.merge(df_student_math,df_student_science,on='ID',how='left').fillna('X')

   ID student_x student_y
0  10       Tom       Tom
1  56      Jack         X
2  31       Dan         X
3  85       Ram         X
4   9      Jeff         X
5  22     David     David

In [19]:
pd.concat([df_student_math,df_student_science],ignore_index=True)

   ID student
0  10     Tom
1  56    Jack
2  31     Dan
3  85     Ram
4   9    Jeff
5  22   David
6  10     Tom
7  12     Ram
8  22   David

In [20]:
df_student_survey_data = pd.DataFrame({'student':['Tom','Jack','Tom','Ram','Jeff','Jack'], 'ID':[10,56,10,85,9,56]})

In [21]:
df_student_survey_data

   ID student
0  10     Tom
1  56    Jack
2  10     Tom
3  85     Ram
4   9    Jeff
5  56    Jack

In [22]:
df_student_survey_data.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [23]:
df_student_survey_data.drop_duplicates('student')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff

In [24]:
df_student_survey_data.drop_duplicates('ID')

   ID student
0  10     Tom
1  56    Jack
3  85     Ram
4   9    Jeff